Revit 2027 API
ImageType.GetImage Method
Get the bitmap image stored in the image symbol.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Bitmap GetImage()
Public Function GetImage As Bitmap
public:
Bitmap^ GetImage()
member GetImage : unit -> Bitmap
Return Value
Bitmap
The bitmap image at the original loaded image size.
See Also
Reference
ImageType Class
Autodesk.Revit.DB Namespace